Documents/БронированиеБилетовПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>БронированиеБилетовПроживания</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДокумента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаКомандировкаКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БронироватьБилеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаБронированияБилетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассПерелета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКлассаБронированияАвиабилетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородВылета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородВылетаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородПрилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородПрилетаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправленияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияПрибытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияПрибытияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправленияТуда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправленияОбратно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БилетВОдинКонец</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БронироватьПроживание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПроживания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПроживанияПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапросаМестаПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗапросаБронированияМестаПроживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаездаПроживания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПроживания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияВПаспорте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВПаспорте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоВПаспорте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПаспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовБронированияБилетовПроживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияПаспорта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пожелания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/БронированиеКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>БронированиеКомандировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБронированияКомандировки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаКомандировку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗаявкаНаБронированиеКомандировки</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТранспортаБронированияБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаБронированияБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самолет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поезд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияБронированияКомандировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияБронированияКомандировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыВыполненияЗаявокКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияЗаявокКабинетСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/БронированиеБилетовПроживания/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализироватьФорму();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	НачатьПолучениеРезультатовБронирования();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_БронированиеБилетовПроживания", Объект.Ссылка, ЭтаФорма);	
	НачатьОжиданиеОбновленияСостоянияЗаявкиНаБронирование();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере();
	ЗапуститьОтложеннуюОбработкуДанных(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_БронированиеБилетовПроживания" И Источник = ЭтаФорма Тогда
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ИнициализироватьФорму()
	
	ИспользоватьБронированиеКомандировок = ПолучитьФункциональнуюОпцию("ИспользоватьБронированиеКомандировок");
	ЗаполнитьПредопределенныеЗначения();
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	Если Объект.ВидТранспорта = Перечисления.ВидыТранспортаБронированияБилетов.Самолет Тогда
		Элементы.БилетыСтраницы.ТекущаяСтраница = Элементы.АвиабилетыСтраница;
		Элементы.АвиаОбратныйБилетГруппа.Видимость = Не Объект.БилетВОдинКонец;
	Иначе
		Элементы.БилетыСтраницы.ТекущаяСтраница = Элементы.ПоездБилетыСтраница;
	КонецЕсли;
	ОбновитьСостояниеЗаявкиНаБронирование(ЭтаФорма);
	ОбновитьСостояниеЗаявкиНаКомандировку();
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОтложеннуюОбработкуДанных(ТекущийОбъект)
	
	БронированиеКомандировокРасширенный.ЗапуститьОтложеннуюОбработкуЗаявкиНаКомандировку(ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредопределенныеЗначения()
	
	ЦветаСтруктура = Новый Структура(
		"Отказ,
		|Информация");
	ЦветаСтруктура.Отказ = ЦветаСтиля.ОшибкиБронированияКомандировокФонЦвет;
	ЦветаСтруктура.Информация = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	
	ЦветаФона = Новый ФиксированнаяСтруктура(ЦветаСтруктура);
	
	КартинкиСтруктура = Новый Структура(
		"ДлительнаяОперация,
		|Информация,
		|Предупреждение");
	
	КартинкиСтруктура.ДлительнаяОперация = БиблиотекаКартинок.ДлительнаяОперация16;
	КартинкиСтруктура.Информация = БиблиотекаКартинок.Информация;
	КартинкиСтруктура.Предупреждение = БиблиотекаКартинок.Предупреждение;
	
	КартинкиБронирования = Новый ФиксированнаяСтруктура(КартинкиСтруктура);
	
	ДоступСтруктура = Новый Структура(
		"Чтение,
		|Изменение");
	ДоступСтруктура.Чтение = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.БронированиеКомандировок);
	ДоступСтруктура.Изменение = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.БронированиеКомандировок);
	
	ДоступностьБронирования = Новый ФиксированнаяСтруктура(ДоступСтруктура);
	
КонецПроцедуры

#Область ПолучениеРезультатаБронирования

&НаКлиенте
Процедура НачатьПолучениеРезультатовБронирования()
	
	РезультатыБронирования = Неопределено;
	
	Если Не ИспользоватьБронированиеКомандировок Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДоступностьБронирования.Чтение Тогда
		Возврат;
	КонецЕсли;
	
	Если СостояниеБронирования <> ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.Обработано") Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = НачатьПолучениеРезультатовБронированияНаСервере(УникальныйИдентификатор, Объект.Ссылка, Объект.СистемаБронирования);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Результаты бронирования'");
	ПараметрыОжидания.ОповещениеПользователя.Пояснение = НСтр("ru = 'Данные бронирования обновлены'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьПолучениеРезультатовБронирования", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьПолучениеРезультатовБронированияНаСервере(ИдентификаторФормы, ЗаявкаСсылка, СистемаБронирования)
	
	ПараметрыПроцедуры = Новый Структура(
		"ЗаявкаСсылка,
		|СистемаБронирования");
	ПараметрыПроцедуры.ЗаявкаСсылка = ЗаявкаСсылка;
	ПараметрыПроцедуры.СистемаБронирования = СистемаБронирования;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение результатов бронирования командировок'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("БронированиеКомандировокРасширенный.ПолучитьРезультатыБронированияПоЗаявкеДлительнаяОперация", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьПолучениеРезультатовБронирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При попытке получить результаты бронирования, возникла ошибка:
                      |%1
                      |Подробнее, см. в Журнале регистрации.'"), 
			Результат.КраткоеПредставлениеОшибки));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРезультатыБронирования(Результат.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезультатыБронирования(АдресРезультата)
	
	Бронирование = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ЗаполнитьБилеты(Бронирование.Билеты);
	ЗаполнитьБроньПроживания(Бронирование.Проживание);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБилеты(Билеты)
	
	Если Не Объект.БронироватьБилеты Тогда
		Возврат;
	КонецЕсли;
	
	Если Билеты.Количество() = 0 Тогда
		ЧастиСтроки = Новый Массив;
		ЧастиСтроки.Добавить(НСтр("ru = 'Информация о результатах бронировании недоступна.'"));
		ЧастиСтроки.Добавить(" ");
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Обновить'"), , , , "ОбновитьРезультатыБронирования"));
		Элементы.СостояниеБилетовНадпись.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
		Элементы.СостояниеБилетовКартинка.Картинка = БиблиотекаКартинок.ИнформацияПоНедоступнымПолям;
		Возврат;
	КонецЕсли;
	
	Элементы.СостояниеБилетовКартинка.Картинка = БиблиотекаКартинок.Информация;
	
	Если Билеты.Количество() = 1 Тогда
		Билет = Билеты[0];
		ДобавитьРезультатБронирования(Билет.Идентификатор, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Билет));
		ЧастиСтроки = Новый Массив;
		ЧастиСтроки.Добавить(НСтр("ru = 'Билет'"));
		ЧастиСтроки.Добавить(" ");
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Билет.Номер, , , , "ПолучитьБронь_" + Формат(Билет.Идентификатор, "ЧГ=")));
		ЧастиСтроки.Добавить(" ");
		ЧастиСтроки.Добавить(НСтр("ru = 'забронирован'"));
		Если Билет.Сумма > 0 Тогда
			ЧастиСтроки.Добавить(", ");
			ЧастиСтроки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'стоимость %1'"), Формат(Билет.Сумма, "ЧДЦ=0")));
		КонецЕсли;
		Элементы.СостояниеБилетовНадпись.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
		Возврат;
	КонецЕсли;
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(НСтр("ru = 'Билеты'"));
	ЧастиСтроки.Добавить(" ");
	
	ИдентификаторыБилетов = Новый Соответствие;
	Для Каждого Билет Из Билеты Цикл
		Если ИдентификаторыБилетов[Билет.Идентификатор] = Неопределено Тогда
			ДобавитьРезультатБронирования(Билет.Идентификатор, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Билет));
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Билет.Номер, , , , "ПолучитьБронь_" + Формат(Билет.Идентификатор, "ЧГ=")));
			ЧастиСтроки.Добавить(", ");
			ИдентификаторыБилетов.Вставить(Билет.Идентификатор, Истина);
		КонецЕсли;
	КонецЦикла;
	
	ЧастиСтроки.Удалить(ЧастиСтроки.ВГраница());
	
	ЧастиСтроки.Добавить(" ");
	ЧастиСтроки.Добавить(НСтр("ru = 'забронированы'"));
	Если Билеты.Итог("Сумма") > 0 Тогда
		ЧастиСтроки.Добавить(", ");
		ЧастиСтроки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'общая стоимость %1'"), Формат(Билеты.Итог("Сумма"), "ЧДЦ=0")));
	КонецЕсли;
	Элементы.СостояниеБилетовНадпись.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБроньПроживания(Проживание)
	
	Если Не Объект.БронироватьПроживание Тогда
		Возврат;
	КонецЕсли;
	
	Если Проживание.Количество() = 0 Тогда
		ЧастиСтроки = Новый Массив;
		ЧастиСтроки.Добавить(НСтр("ru = 'Информация о результатах бронировании недоступна.'"));
		ЧастиСтроки.Добавить(" ");
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Обновить'"), , , , "ОбновитьРезультатыБронирования"));
		Элементы.СостояниеПроживанияНадпись.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
		Элементы.СостояниеПроживанияКартинка.Картинка = БиблиотекаКартинок.ИнформацияПоНедоступнымПолям;
		Возврат;
	КонецЕсли;
	
	Элементы.СостояниеПроживанияКартинка.Картинка = БиблиотекаКартинок.Информация;
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(НСтр("ru = 'Проживание забронировано,'"));
	ЧастиСтроки.Добавить(" ");
	ЧастиСтроки.Добавить(НСтр("ru = 'номер брони'"));
	ЧастиСтроки.Добавить(" ");
	
	ИдентификаторыБрони = Новый Соответствие;
	Для Каждого Бронь Из Проживание Цикл
		Если ИдентификаторыБрони[Бронь.Идентификатор] = Неопределено Тогда
			ДобавитьРезультатБронирования(Бронь.Идентификатор, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Бронь));
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Бронь.Номер, , , , "ПолучитьБронь_" + Формат(Бронь.Идентификатор, "ЧГ=")));
			ЧастиСтроки.Добавить(", ");
			ИдентификаторыБрони.Вставить(Бронь.Идентификатор, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Если Проживание.Итог("Сумма") > 0 Тогда
		ЧастиСтроки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'стоимость %1'"), Формат(Проживание.Итог("Сумма"), "ЧДЦ=0")));
	Иначе
		ЧастиСтроки.Удалить(ЧастиСтроки.ВГраница());
	КонецЕсли;
	Элементы.СостояниеПроживанияНадпись.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРезультатБронирования(Идентификатор, Результат)
	
	Соответствие = Новый Соответствие;
	Если РезультатыБронирования <> Неопределено Тогда
		Соответствие = Новый Соответствие(РезультатыБронирования);
	КонецЕсли;
	
	ОписаниеРезультата = Новый Структура(
		"ВидУслуги,
		|Номер");
	ЗаполнитьЗначенияСвойств(ОписаниеРезультата, Результат);
	
	Соответствие.Вставить(Идентификатор, ОписаниеРезультата);
	
	РезультатыБронирования = Новый ФиксированноеСоответствие(Соответствие);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НачатьОжиданиеОбновленияСостоянияЗаявкиНаБронирование()
	
	Если Не ИспользоватьБронированиеКомандировок Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСостояниеЗаявкиНаБронирование", 3, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОжиданиеОбновленияСостоянияЗаявкиНаБронирование()
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбновитьСостояниеЗаявкиНаБронирование");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСостояниеЗаявкиНаБронирование()
	
	ОбновитьСостояниеЗаявкиНаБронирование(ЭтаФорма);
	
	Если СостояниеБронирования <> ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.Подготовлено") Тогда
		ЗавершитьОжиданиеОбновленияСостоянияЗаявкиНаБронирование();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСостояниеЗаявкиНаБронирование(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Форма.СостояниеБронирования = Неопределено;
	
	Если Не Форма.ДоступностьБронирования.Чтение Тогда
		Элементы.СостояниеБронированияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	МенеджерСостояния = СостояниеЗаявкиНаБронирование(Объект.Ссылка);
	
	Если МенеджерСостояния = Неопределено Тогда
		Элементы.СостояниеБронированияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Форма.СостояниеБронирования = МенеджерСостояния.Состояние;
	
	ОтображаемыеСостояния = Новый Массив;
	ОтображаемыеСостояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.ПустаяСсылка"));
	ОтображаемыеСостояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.Подготовлено"));
	ОтображаемыеСостояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.Отправлено"));
	ОтображаемыеСостояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.Обработано"));
	ОтображаемыеСостояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.Отменено"));
	
	Если ОтображаемыеСостояния.Найти(МенеджерСостояния.Состояние) = Неопределено Тогда
		Элементы.СостояниеБронированияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ОтобразитьСостояниеБронированияПодготовлено(Форма, МенеджерСостояния, Элементы);
	ОтобразитьСостояниеБронированияОшибка(Форма, МенеджерСостояния, Элементы);
	ОтобразитьСостояниеБронированияОтправлено(Форма, МенеджерСостояния, Элементы);
	ОтобразитьСостояниеБронированияОбработано(Форма, МенеджерСостояния, Элементы);
	ОтобразитьСостояниеБронированияОтменено(Форма, МенеджерСостояния, Элементы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеЗаявкиНаБронирование(Заявка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьБронированиеКомандировок") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Заявка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МенеджерСостояния = РегистрыСведений.БронированиеКомандировок.СоздатьМенеджерЗаписи();
	МенеджерСостояния.ЗаявкаНаКомандировку = Заявка;
	МенеджерСостояния.Прочитать();
	
	Если Не МенеджерСостояния.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(МенеджерСостояния, Метаданные.РегистрыСведений.БронированиеКомандировок);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьСостояниеБронированияПодготовлено(Форма, МенеджерСостояния, Элементы)
	
	Если МенеджерСостояния.Состояние <> ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.Подготовлено") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Заявка отправляется в систему бронирования с %1'"),
		Формат(МенеджерСостояния.ДатаСостояния, "ДЛФ=DT"));
		
	Элементы.СостояниеБронированияГруппа.Видимость = Истина;
	Элементы.СостояниеБронированияКартинка.Картинка = Форма.КартинкиБронирования["ДлительнаяОперация"];
	Элементы.СостояниеБронированияГруппа.ЦветФона = Форма.ЦветаФона["Информация"];
	Элементы.СостояниеБронированияПояснение.Заголовок = Новый ФорматированнаяСтрока(ТекстСообщения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьСостояниеБронированияОшибка(Форма, МенеджерСостояния, Элементы)
	
	Если МенеджерСостояния.Состояние <> ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.ПустаяСсылка") Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'При отправке заявки в систему бронирования %1 возникла ошибка:
              |%2'"),
		Формат(МенеджерСостояния.ДатаСостояния, "ДЛФ=DT"),
		МенеджерСостояния.Комментарий));
	ЧастиСтроки.Добавить(Символы.ПС);
	ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Отправить повторно'"), , , , "ОтправитьВСистемуБронирования"));
	
	Элементы.СостояниеБронированияГруппа.Видимость = Истина;
	Элементы.СостояниеБронированияКартинка.Картинка = Форма.КартинкиБронирования["Предупреждение"];
	Элементы.СостояниеБронированияГруппа.ЦветФона = Форма.ЦветаФона["Отказ"];
	Элементы.СостояниеБронированияПояснение.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьСостояниеБронированияОтправлено(Форма, МенеджерСостояния, Элементы)
	
	Если МенеджерСостояния.Состояние <> ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.Отправлено") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СостояниеБронированияГруппа.Видимость = Истина;
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Заявка отправлена в систему бронирования %1 и находится в обработке.'"),
		Формат(МенеджерСостояния.ДатаСостояния, "ДЛФ=DT")));
	ЧастиСтроки.Добавить(Символы.ПС);
	ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Обновить статус обработки'"), , , , "ОбновитьСтатусВСистемеБронирования"));
	
	Элементы.СостояниеБронированияГруппа.Видимость = Истина;
	Элементы.СостояниеБронированияКартинка.Картинка = Форма.КартинкиБронирования["Информация"];
	Элементы.СостояниеБронированияГруппа.ЦветФона = Форма.ЦветаФона["Информация"];
	Элементы.СостояниеБронированияПояснение.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьСостояниеБронированияОбработано(Форма, МенеджерСостояния, Элементы)
	
	Если МенеджерСостояния.Состояние <> ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.Обработано") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СостояниеБронированияГруппа.Видимость = Истина;
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Заявка полностью (или частично) обработана в системе бронирования.'"),
		Формат(МенеджерСостояния.ДатаСостояния, "ДЛФ=DT")));
	ЧастиСтроки.Добавить(Символы.ПС);
	ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Обновить статус обработки'"), , , , "ОбновитьСтатусВСистемеБронирования"));
	
	Элементы.СостояниеБронированияГруппа.Видимость = Истина;
	Элементы.СостояниеБронированияКартинка.Картинка = Форма.КартинкиБронирования["Информация"];
	Элементы.СостояниеБронированияГруппа.ЦветФона = Форма.ЦветаФона["Информация"];
	Элементы.СостояниеБронированияПояснение.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьСостояниеБронированияОтменено(Форма, МенеджерСостояния, Элементы)
	
	Если МенеджерСостояния.Состояние <> ПредопределенноеЗначение("Перечисление.СостоянияБронированияКомандировки.Отменено") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СостояниеБронированияГруппа.Видимость = Истина;
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Бронирование по заявке отменено в системе бронирования %1.'"),
		Формат(МенеджерСостояния.ДатаСостояния, "ДЛФ=DT")));
	
	Элементы.СостояниеБронированияГруппа.Видимость = Истина;
	Элементы.СостояниеБронированияКартинка.Картинка = Форма.КартинкиБронирования["Предупреждение"];
	Элементы.СостояниеБронированияГруппа.ЦветФона = Форма.ЦветаФона["Отказ"];
	Элементы.СостояниеБронированияПояснение.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ОбработатьКомандуОтправитьВСистемуБронирования(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ОбработатьКомандуОбновитьСтатусВСистемеБронирования(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ОбработатьКомандуОбновитьРезультатыБронирования(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ОбработатьКомандуОбновитьПолучитьБронь(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуОтправитьВСистемуБронирования(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> "ОтправитьВСистемуБронирования" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ОтправитьВСистемуБронированияНаСервере();
	
	НачатьОжиданиеОбновленияСостоянияЗаявкиНаБронирование();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуОбновитьСтатусВСистемеБронирования(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> "ОбновитьСтатусВСистемеБронирования" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПолучитьСостояниеБронированияЗаявкиНаСервере();
	НачатьПолучениеРезультатовБронирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуОбновитьРезультатыБронирования(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> "ОбновитьРезультатыБронирования" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	НачатьПолучениеРезультатовБронирования();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработатьКомандуОбновитьПолучитьБронь(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, "ПолучитьБронь_") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ИдентификаторСтрокой = СтрЗаменить(НавигационнаяСсылкаФорматированнойСтроки, "ПолучитьБронь_", "");
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИдентификаторСтрокой) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьПолучениеБрони(Число(ИдентификаторСтрокой));
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьВСистемуБронированияНаСервере()
	
	БронированиеКомандировокРасширенный.УстановитьСостояниеЗаявкиПодготовлена(Объект);
	
	ОбновитьСостояниеЗаявкиНаБронирование(ЭтаФорма);
	БронированиеКомандировокРасширенный.ЗапуститьОтправкуЗаявокБронированияКомандировок(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСостояниеБронированияЗаявкиНаСервере()
	
	БронированиеКомандировокРасширенный.ПолучитьСостояниеБронированияПоЗаявке(Объект);
	ОбновитьСостояниеЗаявкиНаБронирование(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеБрони(ИдентификаторБрони)
	
	ДлительнаяОперация = НачатьПолучениеБрониНаСервере(ИдентификаторБрони, УникальныйИдентификатор, Объект.СистемаБронирования);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Получение подтверждения бронирования'");
	
	ПараметрыОповещения = Новый Структура("ИдентификаторБрони");
	ПараметрыОповещения.ИдентификаторБрони = ИдентификаторБрони;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьПолучениеФайлаБрони", ЭтотОбъект, ПараметрыОповещения);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьПолучениеБрониНаСервере(ИдентификаторБрони, ИдентификаторФормы, СистемаБронирования)
	
	ПараметрыПроцедуры = Новый Структура(
		"ИдентификаторБрони, 
		|СистемаБронирования");
	ПараметрыПроцедуры.ИдентификаторБрони = ИдентификаторБрони;
	ПараметрыПроцедуры.СистемаБронирования = СистемаБронирования;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение подтверждения бронирования'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("БронированиеКомандировокРасширенный.ПолучитьПодтверждениеБронированияДлительнаяОперация", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьПолучениеФайлаБрони(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При получении файла брони возникла ошибка:
                      |%1
                      |Подробнее, см. в Журнале регистрации.'"), 
			Результат.КраткоеПредставлениеОшибки));
		Возврат;
	КонецЕсли;
	
	ОписаниеФайла = Новый ОписаниеПередаваемогоФайла;
	ОписаниеФайла.Хранение = Результат.АдресРезультата;
	ЗаполнитьИмяФайлаБрони(ОписаниеФайла.Имя, ДополнительныеПараметры.ИдентификаторБрони, ЭтаФорма);	
	
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(ОписаниеФайла);
	
	ПараметрыОповещения = Новый Структура("ПолучаемыеФайлы");
	ПараметрыОповещения.ПолучаемыеФайлы = ПолучаемыеФайлы;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ПолучитьБроньПослеУстановкиРасширения", ЭтотОбъект, ПараметрыОповещения);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботы1СПредприятия(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьБроньПослеУстановкиРасширения(РасширениеПодключено, ДополнительныеПараметры) Экспорт
	
	ПолучаемыеФайлы = ДополнительныеПараметры.ПолучаемыеФайлы;
	
	Если Не РасширениеПодключено Тогда
		Для Каждого ОписаниеФайла Из ПолучаемыеФайлы Цикл
			ПолучитьФайл(ОписаниеФайла.Хранение, ОписаниеФайла.Имя);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ЗавершитьПолучениеБрони", ЭтотОбъект);
	НачатьПолучениеФайлов(ОбработчикОповещения, ПолучаемыеФайлы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПолучениеБрони(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПолученныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолученныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сохранено в файл %1'"),
		ПолученныеФайлы[0].Имя);
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьИмяФайлаБрони(ИмяФайла, ИдентификаторБрони, Форма)
	
	ОписаниеБронирования = Форма.РезультатыБронирования[ИдентификаторБрони];
	
	ПараметрыИмени = Новый Структура(
		"ВидУслуги,
		|Номер,
		|ФамилияИнициалы");
	ЗаполнитьЗначенияСвойств(ПараметрыИмени, ОписаниеБронирования);
	
	ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(Форма.Объект.ФизическоеЛицо));
	ПараметрыИмени.ФамилияИнициалы = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" .-", ФамилияИнициалы, "");
	
	ИмяФайла = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку("[ВидУслуги]_[Номер]_[ФамилияИнициалы].pdf", ПараметрыИмени);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеЗаявкиНаКомандировку()
	
	СостояниеЗаявки = "";
	Если ЗначениеЗаполнено(Объект.ОснованиеДокумента) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Объект.ОснованиеДокумента); 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Заявка.РезультатВыполнения КАК РезультатВыполнения
		|ИЗ
		|	Документ.ЗаявкаКомандировкаКабинетСотрудника КАК Заявка
		|ГДЕ
		|	Заявка.Ссылка = &Ссылка";
		УстановитьПривилегированныйРежим(Истина);
		РезультатВыполнения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РезультатВыполнения")[0];
		УстановитьПривилегированныйРежим(Ложь);
		
		СостояниеЗаявки = НСтр("ru = 'На выполнении'");
		Если РезультатВыполнения = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена Тогда
			СостояниеЗаявки = НСтр("ru = 'Согласована'");
		ИначеЕсли РезультатВыполнения = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Отклонена Тогда
			СостояниеЗаявки = НСтр("ru = 'Отклонена'");
		ИначеЕсли РезультатВыполнения = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Аннулирована Тогда
			СостояниеЗаявки = НСтр("ru = 'Аннулирована'");
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
